//Найдите возраст человека, если известно,
// что год его рождения 1991.
// Выведите полученный результат в виде “Возраст = ...”

public class Ex5 {
    public static void main(String[] args) {
        int age = 2023 - 1991;

        System.out.println("Возраст = " + age);
    }
}
